
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Схема = Элементы.Схема.СписокВыбора[0];
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	ВыполнитьЗапросНаСервере();
	
	Элементы.ГруппаРазделы.ТекущаяСтраница = Элементы.РазделОтвет;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗапросНаСервере()
	МножествоПараметровЗапроса = Новый Соответствие;
	МножествоЗаголовковЗапроса = Новый Соответствие;
	
	Для Каждого Стр Из ПараметрыЗапроса.НайтиСтроки(Новый Структура("Активно", Истина)) Цикл
		Если МножественностьПараметровЗапроса Тогда
			ЗначениеПараметра = МножествоПараметровЗапроса.Получить(Стр.Ключ);
			Если ЗначениеПараметра = Неопределено Тогда
				МножествоПараметровЗапроса.Вставить(Стр.Ключ, Стр.Значение);
			Иначе
				Если ТипЗнч(ЗначениеПараметра) <> Тип("Массив") Тогда
					ИмеющеесяЗначениеПараметра = ЗначениеПараметра;
					
					ЗначениеПараметра = Новый Массив;
					ЗначениеПараметра.Добавить(ИмеющеесяЗначениеПараметра);
					
					МножествоПараметровЗапроса.Вставить(Стр.Ключ, ЗначениеПараметра);
				КонецЕсли;
				
				ЗначениеПараметра.Добавить(Стр.Значение);
			КонецЕсли;
		Иначе
			МножествоПараметровЗапроса.Вставить(Стр.Ключ, Стр.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из ЗаголовкиЗапроса.НайтиСтроки(Новый Структура("Активно", Истина)) Цикл
		МножествоЗаголовковЗапроса.Вставить(Стр.Ключ, Стр.Значение);
	КонецЦикла;
	
	ДополнительныеПараметры = Новый Структура("Заголовки", МножествоЗаголовковЗапроса);
	
	ОтветHTTP = РаботаСHttp.Получить(ИдентификаторРесурса, МножествоПараметровЗапроса, ДополнительныеПараметры);
	КодСостояния = ОтветHTTP.КодСостояния;
	
	ЗаголовкиОтвета.Очистить();
	Для Каждого КЗ Из ОтветHTTP.Заголовки Цикл
		ЗаполнитьЗначенияСвойств(ЗаголовкиОтвета.Добавить(), КЗ);
	КонецЦикла;
	ЗаголовкиОтвета.Сортировать("Ключ");
	
	Ответ = ОтветHTTP.ПолучитьТелоКакСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовкиОтветаПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.ЗаголовкиОтвета.ТекущиеДанные;
	ЗначениеЗаголовкаОтвета = ?(ТекущиеДанные = Неопределено, "", ТекущиеДанные.Значение);
КонецПроцедуры
