
&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	ВыполнитьЗапросНаСервере();
	
	Элементы.ГруппаРазделы.ТекущаяСтраница = Элементы.РазделОтвет;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗапросНаСервере()
	МножествоПараметровЗапроса = Новый Соответствие;
	
	Для Каждого Стр Из ПараметрыЗапроса Цикл
		
	КонецЦикла;
	
	ОтветHTTP = РаботаСHttp.Получить(ИдентификаторРесурса, МножествоПараметровЗапроса);
	
	Ответ = XMLСтрока(ОтветHTTP.КодСостояния) + Символы.ПС + ОтветHTTP.ПолучитьТелоКакСтроку();
КонецПроцедуры
