
// SPDX-License-Identifier: Apache-2.0+

#Область ПрограммныйИнтерфейс
// Возвращает имя метода "Получить"
// 
// Возвращаемое значение:
//  Строка - имя метода
//
Функция МетодGET() Экспорт
	Возврат "GET";
КонецФункции

// Возвращает имя метода "ПолучитьЗаголовки"
// 
// Возвращаемое значение:
//  Строка - имя метода
//
Функция МетодHEAD() Экспорт
	Возврат "HEAD";
КонецФункции

// Возвращает имя метода "ОтправитьДляОбработки"
// 
// Возвращаемое значение:
//  Строка - имя метода
//
Функция МетодPOST() Экспорт
	Возврат "POST";
КонецФункции

// Возвращает имя метода "Записать"
// 
// Возвращаемое значение:
//  Строка - имя метода
//
Функция МетодPUT() Экспорт
	Возврат "PUT";
КонецФункции

// Возвращает имя метода "Изменить"
// 
// Возвращаемое значение:
//  Строка - имя метода
//
Функция МетодPATCH() Экспорт
	Возврат "PATCH";
КонецФункции

// Возвращает имя метода "Удалить"
// 
// Возвращаемое значение:
//  Строка - имя метода
//
Функция МетодDELETE() Экспорт
	Возврат "DELETE";
КонецФункции

// Возвращает коллекцию именованных кодов состояния HTTP-сервера
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - ключи: группы кодов состояния типа ФиксированнаяСтруктура, ключи которых коды состояния
//
Функция КодыСостояния() Экспорт
	Возврат Новый ФиксированнаяСтруктура(
		"Информационные, Успешные, Перенаправления, Клиентские, Серверные",
		Новый ФиксированнаяСтруктура( // Информационные
			"Продолжить, ПереключениеПротокола, ВОбработке, РанниеПодсказки",
			100, // Продолжить
			101, // ПереключениеПротокола
			102, // ВОбработке
			103  // РанниеПодсказки
		),
		Новый ФиксированнаяСтруктура( // Успешные
			"Успешно, Создано, Принято, ИнформацияНеАвторитетна, НетСодержимого, СброситьСодержимое, ЧастичноеСодержимое, МножественноеСостояние, ИспользованIM",
			200, // Успешно
			201, // Создано
			202, // Принято
			203, // ИнформацияНеАвторитетна
			204, // НетСодержимого
			205, // СброситьСодержимое
			206, // ЧастичноеСодержимое
			207, // МножественноеСостояние
			226  // ИспользованIM
		),
		Новый ФиксированнаяСтруктура( // Перенаправления
			"МножественныйВыбор, ПеремещенНаПостояннойОснове, Найден, ПросмотрДругихРесурсов, НеМодифицировано, ИспользоватьПрокси, Зарезервировано1, ВременноеПеренаправление, ПеренаправлениеНаПостояннойОснове",
			300, // МножественныйВыбор
			301, // ПеремещенНаПостояннойОснове
			302, // Найден
			303, // ПросмотрДругихРесурсов
			304, // НеМодифицировано
			305, // ИспользоватьПрокси
			306, // Зарезервировано1
			307, // ВременноеПеренаправление
			308  // ПеренаправлениеНаПостояннойОснове
		),
		Новый ФиксированнаяСтруктура( // Клиентские
			"ПлохойЗапрос, НеАвторизовано, НеобходимаОплата, Запрещено, НеНайден, МетодНеРазрешен, НеПриемлемо, НеАвторизованоПрокси, Таймаут, Конфликт, Удалено, ТребуетсяРазмерКонтента, НевыполнимыеУсловия, ПревышенЛимитТела, ПревышенаДлинаURI, ТипМедиаНеПоддерживается, ДиапазонНеМожетБытьВыполнен, ОжиданиеНеМожетБытьВыполнено, Чайник, ТаймаутАвторизации, Мисдирект, НеобрабатываемыйЭкземпляр, Заблокировано, НевыполненнаяЗависимость, НеобходимоОбновление, НеобходимоПредусловие, СлишкомМногоЗапросов, ПоляЗаголовкаСлишкомБольшие, НедостаточноИнформации, НедоступноПоЮридическимПричинам, КлиентЗакрылСоединение",
			400, // ПлохойЗапрос
			401, // НеАвторизовано
			402, // НеобходимаОплата
			403, // Запрещено
			404, // НеНайден
			405, // МетодНеРазрешен
			406, // НеПриемлемо
			407, // НеАвторизованоПрокси
			408, // Таймаут
			409, // Конфликт
			410, // Удалено
			411, // ТребуетсяРазмерКонтента
			412, // НевыполнимыеУсловия
			413, // ПревышенЛимитТела
			414, // ПревышенаДлинаURI
			415, // ТипМедиаНеПоддерживается
			416, // ДиапазонНеМожетБытьВыполнен
			417, // ОжиданиеНеМожетБытьВыполнено
			418, // Чайник
			419, // ТаймаутАвторизации
			421, // Мисдирект
			422, // НеобрабатываемыйЭкземпляр
			423, // Заблокировано
			424, // НевыполненнаяЗависимость
			425, // СлишкомРано
			426, // НеобходимоОбновление
			428, // НеобходимоПредусловие
			429, // СлишкомМногоЗапросов
			431, // ПоляЗаголовкаСлишкомБольшие
			449, // НедостаточноИнформации
			451, // НедоступноПоЮридическимПричинам
			499  // КлиентЗакрылСоединение
		),
		Новый ФиксированнаяСтруктура( // Серверные
			"ВнутренняяОшибка, НеВыполнено, ПлохойШлюз, СервисНедоступен, Таймаут, ВерсияHTTPНеПоддерживается, НеХватаетМеста, БесконечноеПеренаправление, ПревышенТрафик, ОтсутствуетРасширение, ТребуетсяАвторизацияСети, НеизвестнаяОшибка, СерверНеДоступен, ТаймаутПодключения, СерверНедостижим, ТаймаутСоединения, ОшибкаSSL, ОшибкаПодтвержденияСертификата",
			500, // ВнутренняяОшибка
			501, // НеВыполнено
			502, // ПлохойШлюз
			503, // СервисНедоступен
			504, // Таймаут
			505, // ВерсияHTTPНеПоддерживается
			507, // НеХватаетМеста
			508, // БесконечноеПеренаправление
			509, // ПревышенТрафик
			510, // ОтсутствуетРасширение
			511, // ТребуетсяАвторизацияСети
			520, // НеизвестнаяОшибка
			521, // СерверНеДоступен
			522, // ТаймаутПодключения
			523, // СерверНедостижим
			524, // ТаймаутСоединения
			525, // ОшибкаSSL
			526  // ОшибкаПодтвержденияСертификата
		)
	);
КонецФункции

#Область КОДЫ_СОСТОЯНИЙ
// Возвращает код состояния HTTP-сервера 200
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияУспешно() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Успешные.Успешно;
КонецФункции

// Возвращает код состояния HTTP-сервера 201
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияСоздано() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Успешные.Создано;
КонецФункции

// Возвращает код состояния HTTP-сервера 204
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияУспешноБезСодержимого() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Успешные.НетСодержимого;
КонецФункции

// Возвращает код состояния HTTP-сервера 301
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияПеремещен() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Перенаправления.ПеремещенНаПостояннойОснове;
КонецФункции

// Возвращает код состояния HTTP-сервера 302
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияНайден() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Перенаправления.Найден;
КонецФункции

// Возвращает код состояния HTTP-сервера 307
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияВременноеПеренаправление() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Перенаправления.ВременноеПеренаправление;
КонецФункции

// Возвращает код состояния HTTP-сервера 400
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияПлохойЗапрос() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Клиентские.ПлохойЗапрос;
КонецФункции

// Возвращает код состояния HTTP-сервера 401
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияНеАвторизовано() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Клиентские.НеАвторизовано;
КонецФункции

// Возвращает код состояния HTTP-сервера 403
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияЗапрещено() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Клиентские.Запрещено;
КонецФункции

// Возвращает код состояния HTTP-сервера 404
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияНеНайден() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Клиентские.НеНайден;
КонецФункции

// Возвращает код состояния HTTP-сервера 405
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияМетодНеРазрешен() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Клиентские.МетодНеРазрешен;
КонецФункции

// Возвращает код состояния HTTP-сервера 408
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияТаймаутНаКлиенте() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Клиентские.Таймаут;
КонецФункции

// Возвращает код состояния HTTP-сервера 410
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияУдалено() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Клиентские.Удалено;
КонецФункции

// Возвращает код состояния HTTP-сервера 413
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияПревышенЛимитТела() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Клиентские.ПревышенЛимитТела;
КонецФункции

// Возвращает код состояния HTTP-сервера 418
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияЧайник() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Клиентские.Чайник;
КонецФункции

// Возвращает код состояния HTTP-сервера 500
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияВнутренняяОшибкаСервера() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Серверные.ВнутренняяОшибка;
КонецФункции

// Возвращает код состояния HTTP-сервера 501
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияНеВыполнено() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Серверные.НеВыполнено;
КонецФункции

// Возвращает код состояния HTTP-сервера 502
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияПлохойШлюз() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Серверные.ПлохойШлюз;
КонецФункции

// Возвращает код состояния HTTP-сервера 503
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияСервисНедоступен() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Серверные.СервисНедоступен;
КонецФункции

// Возвращает код состояния HTTP-сервера 504
// 
// Возвращаемое значение:
//  Число - код состояния
//
Функция КодСостоянияТаймаутНаСервере() Экспорт
	Возврат КлиентHTTPПовтИсп.КодыСостояния().Серверные.Таймаут;
КонецФункции
#КонецОбласти

// Возвращает множество кодов состояния HTTP-сервера, означающих перенаправление
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие - ключи: коды состояния
//
Функция КодыСостоянияПеренаправления() Экспорт
	фРезультат = Новый Соответствие;
	фРезультат.Вставить(КлиентHTTPПовтИсп.КодСостоянияПеремещен(), Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.КодСостоянияНайден(), Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.КодыСостояния().Перенаправления.ПросмотрДругихРесурсов, Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.КодСостоянияВременноеПеренаправление(), Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.КодыСостояния().Перенаправления.ПеренаправлениеНаПостояннойОснове, Истина);
	
	Возврат Новый ФиксированноеСоответствие(фРезультат);
КонецФункции

// Возвращает адресный перечень MIME-типов
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - ключи: группы типов MIME типа ФиксированнаяСтруктура, ключи которых сами типы
//
Функция ТипыMIME() Экспорт
	Возврат Новый ФиксированнаяСтруктура(
		"application, audio, image, message, model, multipart, text, video, vnd, x, x_pkcs",
		Новый ФиксированнаяСтруктура( // application - внутренний формат прикладной программы
			"atom_xml, directory, EDI_X12, EDIFACT, json, javascript, octet_stream, ogg, pdf, postscript, soap_xml, font_woff, xhtml_xml, xml_dtd, xop_xml, zip, gzip, x_bittorrent, x_tex, xml",
			"application/atom+xml",     // Atom
			"application/directory",    // directory
			"application/EDI-X12",      // EDI X12 (RFC 1767)
			"application/EDIFACT",      // EDI EDIFACT (RFC 1767)
			"application/json",         // JavaScript Object Notation JSON (RFC 4627)
			"application/javascript",   // JavaScript (RFC 4329)
			"application/octet-stream", // двоичный файл без указания формата (RFC 2046)
			"application/ogg",          // Ogg (RFC 5334)
			"application/pdf",          // Portable Document Format, PDF (RFC 3778)
			"application/postscript",   // PostScript (RFC 2046)
			"application/soap+xml",     // SOAP (RFC 3902)
			"application/font-woff",    // Web Open Font Format
			"application/xhtml+xml",    // XHTML (RFC 3236)
			"application/xml-dtd",      // DTD (RFC 3023)
			"application/xop+xml",      // XOP
			"application/zip",          // ZIP
			"application/gzip",         // Gzip
			"application/x-bittorrent", // BitTorrent
			"application/x-tex",        // TeX
			"application/xml"           // XML
		),
		Новый ФиксированнаяСтруктура( // audio - аудио
			"basic, L24, mp4, aac, mpeg, ogg, vorbis, x_ms_wma, x_ms_wax, vnd_rn_realaudio, vnd_wave, webm",
			"audio/basic",            // mulaw аудио, 8 кГц, 1 канал (RFC 2046)
			"audio/L24",              // 24bit Linear PCM аудио, 8-48 кГц, 1-N каналов (RFC 3190)
			"audio/mp4",              // MP4
			"audio/aac",              // AAC
			"audio/mpeg",             // MP3 или др. MPEG (RFC 3003)
			"audio/ogg",              // Ogg Vorbis, Speex, Flac или др. аудио (RFC 5334)
			"audio/vorbis",           // Vorbis (RFC 5215)
			"audio/x-ms-wma",         // Windows Media Audio
			"audio/x-ms-wax",         // Windows Media Audio перенаправление
			"audio/vnd.rn-realaudio", // RealAudio
			"audio/vnd.wave",         // WAV(RFC 2361)
			"audio/webm"              // WebM
		),
		Новый ФиксированнаяСтруктура( // image - изображение
			"gif, jpeg, pjpeg, png, svg_xml, tiff, vnd_microsoft_icon, vnd_wap_wbmp, webp, bmp",
			"image/gif",                // GIF(RFC 2045 и RFC 2046)
			"image/jpeg",               // JPEG (RFC 2045 и RFC 2046)
			"image/pjpeg",              // JPEG
			"image/png",                // Portable Network Graphics (RFC 2083)
			"image/svg+xml",            // SVG
			"image/tiff",               // TIFF(RFC 3302)
			"image/vnd.microsoft.icon", // ICO
			"image/vnd.wap.wbmp",       // WBMP
			"image/webp",               // WebP
			"image/bmp"                 // BMP
		),
		Новый ФиксированнаяСтруктура( // message - сообщение
			"http, imdn_xml, partial, rfc822",
			"message/http",     // (RFC 2616)
			"message/imdn+xml", // IMDN (RFC 5438)
			"message/partial",  // E-mail (RFC 2045 и RFC 2046)
			"message/rfc822"    // E-mail; EML-файлы, MIME-файлы, MHT-файлы, MHTML-файлы (RFC 2045 и RFC 2046)
		),
		Новый ФиксированнаяСтруктура( // model - для 3D-моделей
			"example, iges, mesh, vrml, x3d_binary, x3d_vrml, x3d_xml",
			"model/example",    // (RFC 4735)
			"model/iges",       // IGS файлы, IGES файлы (RFC 2077)
			"model/mesh",       // MSH файлы, MESH файлы (RFC 2077), SILO файлы
			"model/vrml",       // WRL файлы, VRML файлы (RFC 2077)
			"model/x3d+binary", // X3D ISO стандарт для 3D компьютерной графики, X3DB файлы
			"model/x3d+vrml",   // X3D ISO стандарт для 3D компьютерной графики, X3DV VRML файлы
			"model/x3d+xml"     // X3D ISO стандарт для 3D компьютерной графики, X3D XML файлы
		),
		Новый ФиксированнаяСтруктура( // multipart - составные
			"mixed, alternative, related, form_data, signed, encrypted",
			"multipart/mixed",       // MIME E-mail (RFC 2045 и RFC 2046)
			"multipart/alternative", // MIME E-mail (RFC 2045 и RFC 2046)
			"multipart/related",     // MIME E-mail (RFC 2387 и используемое MHTML (HTML mail))
			"multipart/form-data",   // MIME Webform (RFC 2388)
			"multipart/signed",      // (RFC 1847)
			"multipart/encrypted"    // (RFC 1847)
		),
		Новый ФиксированнаяСтруктура( // text - текст
			"cmd, css, csv, html, javascript, plain, php, xml, markdown, cache_manifest",
			"text/cmd",           // команды
			"text/css",           // Cascading Style Sheets (RFC 2318)
			"text/csv",           // CSV (RFC 4180)
			"text/html",          // HTML (RFC 2854)
			"text/javascript",    // (Obsolete): JavaScript (RFC 4329)
			"text/plain",         // текстовые данные (RFC 2046 и RFC 3676)
			"text/php",           // Скрипт языка PHP
			"text/xml",           // Extensible Markup Language (RFC 3023)
			"text/markdown",      // файл языка разметки Markdown (RFC 7763)
			"text/cache-manifest" // файл манифеста(RFC 2046)
		),
		Новый ФиксированнаяСтруктура( // video - видео
			"mpeg, mp4, ogg, quicktime, webm, x_ms_wmv, x_flv, _3gpp, _3gpp2",
			"video/mpeg",      // MPEG-1 (RFC 2045 и RFC 2046)
			"video/mp4",       // MP4 (RFC 4337)
			"video/ogg",       // Ogg Theora или другое видео (RFC 5334)
			"video/quicktime", // QuickTime
			"video/webm",      // WebM
			"video/x-ms-wmv",  // Windows Media Video
			"video/x-flv",     // FLV
			"video/3gpp",      // 3gpp .3gp
			"video/3gpp2"      // 3gpp2 .3g2
		),
		Новый ФиксированнаяСтруктура( // vnd - вендорные файлы
			"oot, oos, oop, oog, ms_excel, ms_excel_2007, ms_powerpoint, ms_powerpoint_2007, ms_word, ms_word_2007, mozilla_xul_xml, google_earth_kml_xml",
			"application/vnd.oasis.opendocument.text",                                   // OpenDocument
			"application/vnd.oasis.opendocument.spreadsheet",                            // OpenDocument
			"application/vnd.oasis.opendocument.presentation",                           // OpenDocument
			"application/vnd.oasis.opendocument.graphics",                               // OpenDocument
			"application/vnd.ms-excel",                                                  // Microsoft Excel файлы
			"application/vnd.openxmlformats-officedocument.spreadsheetml.sheet",         // Microsoft Excel 2007 файлы
			"application/vnd.ms-powerpoint",                                             // Microsoft Powerpoint файлы
			"application/vnd.openxmlformats-officedocument.presentationml.presentation", // Microsoft Powerpoint 2007 файлы
			"application/msword",                                                        // Microsoft Word файлы
			"application/vnd.openxmlformats-officedocument.wordprocessingml.document",   // Microsoft Word 2007 файлы
			"application/vnd.mozilla.xul+xml",                                           // Mozilla XUL файлы
			"application/vnd.google-earth.kml+xml"                                       // KML файлы (например, для Google Earth)
		),
		Новый ФиксированнаяСтруктура( // x - нестандартные файлы
			"www_form_urlencoded, dvi, latex, font_ttf, shockwave_flash, stuffit, zip_compressed, rar_compressed, tar, jquery_tmpl, javascript",
			"application/x-www-form-urlencoded", // Form Encoded Data
			"application/x-dvi",                 // DVI
			"application/x-latex",               // LaTeX файлы
			"application/x-font-ttf",            // TrueType (не зарегистрированный MIME-тип, но наиболее часто используемый)
			"application/x-shockwave-flash",     // Adobe Flash
			"application/x-stuffit",             // StuffIt
			"application/x-zip-compressed",      // ZIP
			"application/x-rar-compressed",      // RAR
			"application/x-tar",                 // Tarball
			"text/x-jquery-tmpl",                // jQuery
			"application/x-javascript"           // javascript
		),
		Новый ФиксированнаяСтруктура( // x_pkcs - Public Key Cryptography Standards
			"pkcs12, pkcs7_certificates, pkcs7_certreqresp, pkcs7_mime, pkcs7_signature",
			"application/x-pkcs12",             // p12 и pfx файлы
			"application/x-pkcs7-certificates", // p7b и spc файлы
			"application/x-pkcs7-certreqresp",  // p7r файлы
			"application/x-pkcs7-mime",         // p7c и p7m файлы
			"application/x-pkcs7-signature"     // p7s файлы
		)
	);
КонецФункции

#Область ТИПЫ_MIME
// Возвращает MIME-тип application/json
// 
// Возвращаемое значение:
//  Строка - MIME-тип
//
Функция ТипMIMEJSON() Экспорт
	Возврат КлиентHTTPПовтИсп.ТипыMIME().application.json;
КонецФункции

// Возвращает MIME-тип text/plain
// 
// Возвращаемое значение:
//  Строка - MIME-тип
//
Функция ТипMIMEText() Экспорт
	Возврат КлиентHTTPПовтИсп.ТипыMIME().text.plain;
КонецФункции

// Возвращает MIME-тип text/xml
// 
// Возвращаемое значение:
//  Строка - MIME-тип
//
Функция ТипMIMETextXML() Экспорт
	Возврат КлиентHTTPПовтИсп.ТипыMIME().text.xml;
КонецФункции

// Возвращает MIME-тип text/html
// 
// Возвращаемое значение:
//  Строка - MIME-тип
//
Функция ТипMIMEHTML() Экспорт
	Возврат КлиентHTTPПовтИсп.ТипыMIME().text.html;
КонецФункции

// Возвращает MIME-тип application/octet-stream
// 
// Возвращаемое значение:
//  Строка - MIME-тип
//
Функция ТипMIMEOctetStream() Экспорт
	Возврат КлиентHTTPПовтИсп.ТипыMIME().application.octet_stream;
КонецФункции

// Возвращает MIME-тип application/pdf
// 
// Возвращаемое значение:
//  Строка - MIME-тип
//
Функция ТипMIMEPDF() Экспорт
	Возврат КлиентHTTPПовтИсп.ТипыMIME().application.pdf;
КонецФункции

// Возвращает MIME-тип application/vnd.ms-excel
// 
// Возвращаемое значение:
//  Строка - MIME-тип
//
Функция ТипMIMEExcel() Экспорт
	Возврат КлиентHTTPПовтИсп.ТипыMIME().vnd.ms_excel;
КонецФункции

// Возвращает MIME-тип application/vnd.openxmlformats-officedocument.spreadsheetml.sheet
// 
// Возвращаемое значение:
//  Строка - MIME-тип
//
Функция ТипMIMEExcel2007() Экспорт
	Возврат КлиентHTTPПовтИсп.ТипыMIME().vnd.ms_excel_2007;
КонецФункции

// Возвращает MIME-тип image/jpeg
// 
// Возвращаемое значение:
//  Строка - MIME-тип
//
Функция ТипMIMEJPEG() Экспорт
	Возврат КлиентHTTPПовтИсп.ТипыMIME().image.jpeg;
КонецФункции

// Возвращает MIME-тип image/gif
// 
// Возвращаемое значение:
//  Строка - MIME-тип
//
Функция ТипMIMEGIF() Экспорт
	Возврат КлиентHTTPПовтИсп.ТипыMIME().image.gif;
КонецФункции

// Возвращает MIME-тип image/png
// 
// Возвращаемое значение:
//  Строка - MIME-тип
//
Функция ТипMIMEPNG() Экспорт
	Возврат КлиентHTTPПовтИсп.ТипыMIME().image.png;
КонецФункции

// Возвращает MIME-тип application/zip
// 
// Возвращаемое значение:
//  Строка - MIME-тип
//
Функция ТипMIMEZip() Экспорт
	Возврат КлиентHTTPПовтИсп.ТипыMIME().application.zip;
КонецФункции

// Возвращает MIME-тип application/x-zip-compressed
// 
// Возвращаемое значение:
//  Строка - MIME-тип
//
Функция ТипMIMEZipCompressed() Экспорт
	Возврат КлиентHTTPПовтИсп.ТипыMIME().x.zip_compressed;
КонецФункции

// Возвращает MIME-тип application/x-www-form-urlencoded
// 
// Возвращаемое значение:
//  Строка - MIME-тип
//
Функция ТипMIMEXWWWFormUrlEncoded() Экспорт
	Возврат КлиентHTTPПовтИсп.ТипыMIME().x.www_form_urlencoded;
КонецФункции

// Возвращает MIME-тип multipart/form-data
// 
// Возвращаемое значение:
//  Строка - MIME-тип
//
Функция ТипMIMEMultipartFromData() Экспорт
	Возврат КлиентHTTPПовтИсп.ТипыMIME().multipart.form_data;
КонецФункции
#КонецОбласти

// Возвращает множество предполагаемых MIME-типов для расширений файлов
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие - ключи: расширения файлов
//
Функция ТипыMIMEРасширенийФайлов() Экспорт
	фРезультат = Новый Соответствие;
	фРезультат.Вставить("jpg",  КлиентHTTPПовтИсп.ТипMIMEJPEG());
	фРезультат.Вставить("jpeg", КлиентHTTPПовтИсп.ТипMIMEJPEG());
	фРезультат.Вставить("png",  КлиентHTTPПовтИсп.ТипMIMEPNG());
	фРезультат.Вставить("gif",  КлиентHTTPПовтИсп.ТипMIMEGIF());
	фРезультат.Вставить("tiff", КлиентHTTPПовтИсп.ТипыMIME().image.tiff);
	фРезультат.Вставить("webp", КлиентHTTPПовтИсп.ТипыMIME().image.webp);
	фРезультат.Вставить("bmp",  КлиентHTTPПовтИсп.ТипыMIME().image.bmp);
	фРезультат.Вставить("xls",  КлиентHTTPПовтИсп.ТипMIMEExcel());
	фРезультат.Вставить("xlsx", КлиентHTTPПовтИсп.ТипMIMEExcel2007());
	фРезультат.Вставить("zip",  КлиентHTTPПовтИсп.ТипMIMEZip());
	фРезультат.Вставить("json", КлиентHTTPПовтИсп.ТипMIMEJSON());
	фРезультат.Вставить("xml",  КлиентHTTPПовтИсп.ТипMIMETextXML());
	фРезультат.Вставить("pdf",  КлиентHTTPПовтИсп.ТипMIMEPDF());
	фРезультат.Вставить("mp4",  КлиентHTTPПовтИсп.ТипыMIME().video.mp4);
	фРезультат.Вставить("webm", КлиентHTTPПовтИсп.ТипыMIME().video.webm);
	фРезультат.Вставить("flv",  КлиентHTTPПовтИсп.ТипыMIME().video.x_flv);
	фРезультат.Вставить("mp3",  КлиентHTTPПовтИсп.ТипыMIME().audio.mpeg);
	фРезультат.Вставить("bat",  КлиентHTTPПовтИсп.ТипыMIME().text.cmd);
	фРезультат.Вставить("sh",   КлиентHTTPПовтИсп.ТипыMIME().text.cmd);
	фРезультат.Вставить("css",  КлиентHTTPПовтИсп.ТипыMIME().text.css);
	фРезультат.Вставить("csv",  КлиентHTTPПовтИсп.ТипыMIME().text.csv);
	фРезультат.Вставить("html", КлиентHTTPПовтИсп.ТипыMIME().text.html);
	фРезультат.Вставить("js",   КлиентHTTPПовтИсп.ТипыMIME().text.javascript);
	фРезультат.Вставить("php",  КлиентHTTPПовтИсп.ТипыMIME().text.php);
	фРезультат.Вставить("md",   КлиентHTTPПовтИсп.ТипыMIME().text.markdown);
	фРезультат.Вставить("txt",  КлиентHTTPПовтИсп.ТипMIMEText());
	
	Возврат Новый ФиксированноеСоответствие(фРезультат);
КонецФункции

// Возвращает множество MIME-типов текстовых данных
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие - ключи: MIME-типы
//
Функция ТипыMIMEТекстовыхДанных() Экспорт
	фРезультат = Новый Соответствие;
	фРезультат.Вставить(КлиентHTTPПовтИсп.ТипMIMEText(), Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.ТипMIMEJSON(), Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.ТипMIMETextXML(), Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.ТипыMIME().text.cmd, Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.ТипыMIME().text.css, Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.ТипыMIME().text.csv, Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.ТипMIMEHTML(), Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.ТипыMIME().text.javascript, Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.ТипыMIME().text.php, Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.ТипыMIME().text.markdown, Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.ТипыMIME().application.atom_xml, Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.ТипыMIME().application.soap_xml, Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.ТипыMIME().application.xhtml_xml, Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.ТипыMIME().application.xml_dtd, Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.ТипыMIME().application.xop_xml, Истина);
	фРезультат.Вставить(КлиентHTTPПовтИсп.ТипыMIME().application.xml, Истина);
	
	Возврат Новый ФиксированноеСоответствие(фРезультат);
КонецФункции

// Возвращает кодировку по умолчанию для HTTP-клиента
// 
// Возвращаемое значение:
//  Строка - кодировка
//
Функция КодировкаПоУмолчанию() Экспорт
	Возврат КлиентHTTPПовтИсп.КодировкаUTF8();
КонецФункции

// Возвращает кодировку UTF-7
// 
// Возвращаемое значение:
//  Строка - кодировка
//
Функция КодировкаUTF7() Экспорт
	Возврат "UTF-7";
КонецФункции

// Возвращает кодировку UTF-8
// 
// Возвращаемое значение:
//  Строка - кодировка
//
Функция КодировкаUTF8() Экспорт
	Возврат "UTF-8";
КонецФункции

// Возвращает кодировку UTF-16
// 
// Возвращаемое значение:
//  Строка - кодировка
//
Функция КодировкаUTF16() Экспорт
	Возврат "UTF-16";
КонецФункции

// Возвращает кодировку UTF-32
// 
// Возвращаемое значение:
//  Строка - кодировка
//
Функция КодировкаUTF32() Экспорт
	Возврат "UTF-32";
КонецФункции

// Возвращает кодировку CESU-8
// 
// Возвращаемое значение:
//  Строка - кодировка
//
Функция КодировкаCESU8() Экспорт
	Возврат "CESU-8";
КонецФункции

// Возвращает кодировку ASCII
// 
// Возвращаемое значение:
//  Строка - кодировка
//
Функция КодировкаASCII() Экспорт
	Возврат "US-ASCII";
КонецФункции

// Возвращает кодировку KOI8-R
// 
// Возвращаемое значение:
//  Строка - кодировка
//
Функция КодировкаKOI8R() Экспорт
	Возврат "KOI8-R";
КонецФункции

// Возвращает кодировку windows-1251
// 
// Возвращаемое значение:
//  Строка - кодировка
//
Функция КодировкаWindows1251() Экспорт
	Возврат "windows-1251";
КонецФункции

// Возвращает кодировку cp866
// 
// Возвращаемое значение:
//  Строка - кодировка
//
Функция КодировкаCP866() Экспорт
	Возврат "cp866";
КонецФункции

// Возвращает имя заголовка, содержащего тип контента
// 
// Возвращаемое значение:
//  Строка - имя заголовка
//
Функция ЗаголовокТипКонтента() Экспорт
	Возврат "Content-Type";
КонецФункции

// Возвращает имя заголовка ответа с Cookie
// 
// Возвращаемое значение:
//  Строка - имя заголовка
//
Функция ЗаголовокОтветаСПеченьем() Экспорт
	Возврат "Set-Cookie";
КонецФункции

// Возвращает имя заголовка ответа, содержащего тип сжатия содержимого тела ответа
// 
// Возвращаемое значение:
//  Строка - имя заголовка
//
Функция ЗаголовокОтветаСжатиеТела() Экспорт
	Возврат "Content-Encoding";
КонецФункции

// Возвращает имя заголовка ответа с URI перенаправления
// 
// Возвращаемое значение:
//  Строка - имя заголовка
//
Функция ЗаголовокОтветаПеренаправление() Экспорт
	Возврат "Location";
КонецФункции

// Возвращает дату, называемую эпохой Unix
// 
// Возвращаемое значение:
//  Дата - полночь 01.01.1970
//
Функция ЭпохаUnix() Экспорт
	Возврат Дата(1970, 1, 1);
КонецФункции
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Возвращает константы алгоритма преобразования Punycode
// 
// Возвращаемое значение:
//  Структура - служебный объект конфигурации преобразования punycode
//
Функция ПараметрыPunycode() Экспорт
	Возврат Новый Структура(
		"TMin, TMax, Base, InitialN, InitialBias, Damp, Skew, Delimiter, НаибольшееЧисло",
		1,   // TMin
		26,  // TMax
		36,  // Base
		128, // InitialN
		72,  // InitialBias
		700, // Damp
		38,  // Skew
		"-", // Delimiter
		9999999999 // НаибольшееЧисло
	);
КонецФункции

// Возвращает имена состояний ДКА для парсинга значения заголовка HTTP-ответа Set-Cookie
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - служебный объект конфигурации ДКА
//
Функция СостоянияДКАПарсингаПеченья() Экспорт
	Возврат Новый ФиксированнаяСтруктура(
		"ИмяПеченьки, ЗначениеПеченьки, ИмяАтрибута, ЗначениеАтрибута, ИмяИлиЗначениеПеченьки, ИмяПеченькиИлиЗначениеАтрибута",
		"A",  // ИмяПеченьки
		"B",  // ЗначениеПеченьки
		"C",  // ИмяАтрибута
		"D",  // ЗначениеАтрибута
		"AB", // ИмяИлиЗначениеПеченьки
		"AD"  // ИмяПеченькиИлиЗначениеАтрибута
	);
КонецФункции

// Возвращает карту переходов между состояниями ДКА для парсинга значения заголовка HTTP-ответа Set-Cookie
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие - служебный объект конфигурации ДКА обработки Cookies
//
Функция ДКАПарсингаПеченья() Экспорт
	фРезультат = Новый Соответствие;
	СостоянияДКА = КлиентHTTPПовтИсп.СостоянияДКАПарсингаПеченья();
	ТипыТокенов = КлиентHTTPПовтИсп.ТипыТокеновПарсингаПеченья();
	
	ИмяПеченьки = Новый Соответствие;
	ИмяПеченьки.Вставить(ТипыТокенов.РазделителиПар,       СостоянияДКА.ЗначениеПеченьки);
	ИмяПеченьки.Вставить(ТипыТокенов.РазделителиАтрибутов, СостоянияДКА.ИмяАтрибута);
	ИмяПеченьки.Вставить(ТипыТокенов.РазделителиПеченья,   СостоянияДКА.ИмяПеченьки);

	ЗначениеПеченьки = Новый Соответствие;
	ЗначениеПеченьки.Вставить(ТипыТокенов.РазделителиПар,       СостоянияДКА.ЗначениеПеченьки);
	ЗначениеПеченьки.Вставить(ТипыТокенов.РазделителиАтрибутов, СостоянияДКА.ИмяАтрибута);
	ЗначениеПеченьки.Вставить(ТипыТокенов.РазделителиПеченья,   СостоянияДКА.ИмяИлиЗначениеПеченьки);

	ИмяАтрибута = Новый Соответствие;
	ИмяАтрибута.Вставить(ТипыТокенов.РазделителиПар,       СостоянияДКА.ЗначениеАтрибута);
	ИмяАтрибута.Вставить(ТипыТокенов.РазделителиАтрибутов, СостоянияДКА.ИмяАтрибута);
	ИмяАтрибута.Вставить(ТипыТокенов.РазделителиПеченья,   СостоянияДКА.ИмяПеченьки);

	ЗначениеАтрибута = Новый Соответствие;
	ЗначениеАтрибута.Вставить(ТипыТокенов.РазделителиАтрибутов, СостоянияДКА.ИмяАтрибута);
	ЗначениеАтрибута.Вставить(ТипыТокенов.РазделителиПеченья,   СостоянияДКА.ИмяПеченькиИлиЗначениеАтрибута);

	ИмяИлиЗначениеПеченьки = Новый Соответствие;
	ИмяИлиЗначениеПеченьки.Вставить(ТипыТокенов.РазделителиПар,       СостоянияДКА.ЗначениеПеченьки);
	ИмяИлиЗначениеПеченьки.Вставить(ТипыТокенов.РазделителиАтрибутов, СостоянияДКА.ИмяАтрибута);
	ИмяИлиЗначениеПеченьки.Вставить(ТипыТокенов.РазделителиПеченья,   СостоянияДКА.ИмяИлиЗначениеПеченьки);

	ИмяПеченькиИлиЗначениеАтрибута = Новый Соответствие;
	ИмяПеченькиИлиЗначениеАтрибута.Вставить(ТипыТокенов.РазделителиПар,       СостоянияДКА.ЗначениеПеченьки);
	ИмяПеченькиИлиЗначениеАтрибута.Вставить(ТипыТокенов.РазделителиАтрибутов, СостоянияДКА.ИмяАтрибута);
	ИмяПеченькиИлиЗначениеАтрибута.Вставить(ТипыТокенов.РазделителиПеченья,   СостоянияДКА.ИмяПеченькиИлиЗначениеАтрибута);

	фРезультат.Вставить(СостоянияДКА.ИмяПеченьки,                    ИмяПеченьки);
	фРезультат.Вставить(СостоянияДКА.ЗначениеПеченьки,               ЗначениеПеченьки);
	фРезультат.Вставить(СостоянияДКА.ИмяАтрибута,                    ИмяАтрибута);
	фРезультат.Вставить(СостоянияДКА.ЗначениеАтрибута,               ЗначениеАтрибута);
	фРезультат.Вставить(СостоянияДКА.ИмяИлиЗначениеПеченьки,         ИмяИлиЗначениеПеченьки);
	фРезультат.Вставить(СостоянияДКА.ИмяПеченькиИлиЗначениеАтрибута, ИмяПеченькиИлиЗначениеАтрибута);
	
	Возврат Новый ФиксированноеСоответствие(фРезультат);
КонецФункции

// Возвращает имена атрибутов Cookie в нижнем регистре
// 
// Возвращаемое значение:
//  ФиксированныйМассив - служебная коллекция для обработки Cookies
//
Функция ТокеныПарсингаПеченьяАтрибуты() Экспорт
	фРезультат = Новый Массив;
	фРезультат.Добавить("expires");
	фРезультат.Добавить("max-age");
	фРезультат.Добавить("domain");
	фРезультат.Добавить("path");
	фРезультат.Добавить("secure");
	фРезультат.Добавить("httponly");
	фРезультат.Добавить("samesite");
	
	Возврат Новый ФиксированныйМассив(фРезультат);
КонецФункции

// Возвращает токены-разделители пар ключ-значение Cookie
// 
// Возвращаемое значение:
//  ФиксированныйМассив - служебная коллекция для обработки Cookies
//
Функция ТокеныПарсингаПеченьяРазделителиПар() Экспорт
	фРезультат = Новый Массив;
	фРезультат.Добавить("=");
	
	Возврат Новый ФиксированныйМассив(фРезультат);
КонецФункции

// Возвращает токены-разделители атрибутов Cookie
// 
// Возвращаемое значение:
//  ФиксированныйМассив - служебная коллекция для обработки Cookies
//
Функция ТокеныПарсингаПеченьяРазделителиАтрибутов() Экспорт
	фРезультат = Новый Массив;
	фРезультат.Добавить(";");
	
	Возврат Новый ФиксированныйМассив(фРезультат);
КонецФункции

// Возвращает токены-разделители Cookie в значении заголовка HTTP-ответа Set-Cookie
// 
// Возвращаемое значение:
//  ФиксированныйМассив - служебная коллекция для обработки Cookies
//
Функция ТокеныПарсингаПеченьяРазделителиПеченья() Экспорт
	фРезультат = Новый Массив;
	фРезультат.Добавить(",");
	
	Возврат Новый ФиксированныйМассив(фРезультат);
КонецФункции

// Возвращает токены парсинга значения заголовка HTTP-ответа Set-Cookie
// 
// Возвращаемое значение:
//  ФиксированныйМассив - служебная коллекция для обработки Cookies
//
Функция ТокеныПарсингаПеченья() Экспорт
	фРезультат = Новый Массив;
	ТипыТокенов = КлиентHTTPПовтИсп.ТипыТокеновПарсингаПеченья();
	
	КоличествоЗапятыхВАтрибуте = Новый Соответствие;
	КоличествоЗапятыхВАтрибуте.Вставить("expires", 1);
	КоличествоЗапятыхВАтрибуте.Вставить("max-age", 0);
	КоличествоЗапятыхВАтрибуте.Вставить("domain",  0);
	
	ТокеныТипов = Новый Массив;
	ТокеныТипов.Добавить(Новый Структура("Тип, Токены", ТипыТокенов.Атрибуты,             КлиентHTTPПовтИсп.ТокеныПарсингаПеченьяАтрибуты()));
	ТокеныТипов.Добавить(Новый Структура("Тип, Токены", ТипыТокенов.РазделителиПар,       КлиентHTTPПовтИсп.ТокеныПарсингаПеченьяРазделителиПар()));
	ТокеныТипов.Добавить(Новый Структура("Тип, Токены", ТипыТокенов.РазделителиАтрибутов, КлиентHTTPПовтИсп.ТокеныПарсингаПеченьяРазделителиАтрибутов()));
	ТокеныТипов.Добавить(Новый Структура("Тип, Токены", ТипыТокенов.РазделителиПеченья,   КлиентHTTPПовтИсп.ТокеныПарсингаПеченьяРазделителиПеченья()));

	Для Каждого ТокеныТипа Из ТокеныТипов Цикл
		Для Каждого Токен Из ТокеныТипа.Токены Цикл
			фРезультат.Добавить(
				Новый Структура(
					"Значение, Тип, Смещение, КоличествоЗапятых",
					Токен,           // Значение
					ТокеныТипа.Тип,  // Тип
					СтрДлина(Токен), // Смещение
					КоличествоЗапятыхВАтрибуте.Получить(Токен) // КоличествоЗапятых
				)
			);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(фРезультат);
КонецФункции

// Возвращает перечисление типов токенов для парсинга значения заголовка HTTP-ответа Set-Cookie
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - служебный объект для обработки Cookies
//
Функция ТипыТокеновПарсингаПеченья() Экспорт
	Возврат Новый ФиксированнаяСтруктура(
		"Атрибуты, РазделителиПар, РазделителиАтрибутов, РазделителиПеченья",
		0, // Атрибуты
		1, // РазделителиПар
		2, // РазделителиАтрибутов
		3  // РазделителиПеченья
	);
КонецФункции

// Возвращает карту имён атрибутов Cookie к именам свойств в базе сессии
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие - служебный словарь для обработки Cookies
//
Функция АтрибутыКакСвойства() Экспорт
	фРезультат = Новый Соответствие;
	фРезультат.Вставить("expires", "Срок");
	фРезультат.Вставить("max-age", "ВремяАктуальности");
	фРезультат.Вставить("path",    "АдресРесурса");
	фРезультат.Вставить("secure",  "ЗащищенноеСоединение");
	
	Возврат Новый ФиксированноеСоответствие(фРезультат);
КонецФункции

// Возвращает имена атрибутов Cookie по именам свойств в базе сессии
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - служебный объект для обработки Cookies
//
Функция СвойстваКакАтрибуты() Экспорт
	фРезультат = Новый Структура;
	
	Атрибуты = КлиентHTTPПовтИсп.АтрибутыКакСвойства();
	Для Каждого КЗ Из Атрибуты Цикл
		Если КЗ.Ключ = "max-age" Тогда
			Продолжить;
		КонецЕсли;
		фРезультат.Вставить(КЗ.Значение, КЗ.Ключ);
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(фРезультат);
КонецФункции

// Возвращает имя свойства Cookie "expires" (атрибут) в базе сессии
// 
// Возвращаемое значение:
//  Строка - служебное значение для обработки Cookies
//
Функция СвойствоПеченькаСрок() Экспорт
	Возврат "Срок";
КонецФункции

// Возвращает имя свойства Cookie "max-age" (атрибут) в базе сессии
// 
// Возвращаемое значение:
//  Строка - служебное значение для обработки Cookies
//
Функция СвойствоПеченькаВремяАктуальности() Экспорт
	Возврат "ВремяАктуальности";
КонецФункции

// Возвращает имя свойства Cookie "path" (атрибут) в базе сессии
// 
// Возвращаемое значение:
//  Строка - служебное значение для обработки Cookies
//
Функция СвойствоПеченькаАдресРесурса() Экспорт
	Возврат "АдресРесурса";
КонецФункции

// Возвращает имя свойства Cookie "secure" (атрибут) в базе сессии
// 
// Возвращаемое значение:
//  Строка - служебное значение для обработки Cookies
//
Функция СвойствоПеченькаЗащищенноеСоединение() Экспорт
	Возврат "ЗащищенноеСоединение";
КонецФункции

// Возвращает области двоичных данных файла в ZIP-архиве и их размеры в байтах
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - служебный объект формирования ZIP-архива
//
Функция ОбластиФайлаВАрхивеZIP() Экспорт
	фРезультат = Новый Структура("РазмерLFH, РазмерDD, РазмерCDFH, РазмерEOCD, ОбластьLFH, ОбластьDD, ОбластьCDFH, ОбластьEOCD", 42, 16, 58, 22);
	
	// Local File Header - используется для описания метаданных файла
	ОбластьLFH = Новый БуферДвоичныхДанных(фРезультат.РазмерLFH);
	ОбластьLFH.ЗаписатьЦелое32(0,  67324752); // обязательная сигнатура 0x04034b50
	ОбластьLFH.ЗаписатьЦелое16(4,  20);       // минимальная версия для распаковки
	ОбластьLFH.ЗаписатьЦелое16(6,  10);       // битовый флаг
	ОбластьLFH.ЗаписатьЦелое16(8,  8);        // метод сжатия (0 - без сжатия, 8 - deflate)
	ОбластьLFH.ЗаписатьЦелое16(10, 0);        // время модификации файла
	ОбластьLFH.ЗаписатьЦелое16(12, 0);        // дата модификации файла
	ОбластьLFH.ЗаписатьЦелое32(14, 0);        // контрольная сумма
	ОбластьLFH.ЗаписатьЦелое32(18, 0);        // размер сжатых данных
	ОбластьLFH.ЗаписатьЦелое32(22, 0);        // размер несжатых данных
	ОбластьLFH.ЗаписатьЦелое16(26, 12);       // длина название файла
	ОбластьLFH.ЗаписатьЦелое16(28, 0);        // длина поля с дополнительными данными
	// Название файла (размером filenameLength) заполнить позже
	
	// Data descriptor - дополнение метаданных для Local File Header
	ОбластьDD = Новый БуферДвоичныхДанных(фРезультат.РазмерDD);
	ОбластьDD.ЗаписатьЦелое32(0, 134695760); // необязательная сигнатура, равна 0x08074b50
	// Контрольнюу сумму, размеры сжатых и не сжатых данных заполнить позже
	
	// Central directory file header - расширенное описание метаданных файла
	ОбластьCDFH = Новый БуферДвоичныхДанных(фРезультат.РазмерCDFH);
	ОбластьCDFH.ЗаписатьЦелое32(0,  33639248);   // обязательная сигнатура, равна 0x02014b50
	ОбластьCDFH.ЗаписатьЦелое16(4,  798);        // версия файла
	ОбластьCDFH.ЗаписатьЦелое16(6,  20);         // минимальная версия для распаковки
	ОбластьCDFH.ЗаписатьЦелое16(8,  10);         // Битовый флаг
	ОбластьCDFH.ЗаписатьЦелое16(10, 8);          // метод сжатия (0 - без сжатия, 8 - deflate)
	ОбластьCDFH.ЗаписатьЦелое16(12, 0);          // время модификации файла
	ОбластьCDFH.ЗаписатьЦелое16(14, 0);          // дата модификации файла
	ОбластьCDFH.ЗаписатьЦелое16(28, 12);         // длина название файла
	ОбластьCDFH.ЗаписатьЦелое16(30, 0);          // длина поля с дополнительными данными
	ОбластьCDFH.ЗаписатьЦелое16(32, 0);          // длина комментариев к файлу
	ОбластьCDFH.ЗаписатьЦелое16(34, 0);          // номер диска
	ОбластьCDFH.ЗаписатьЦелое16(36, 0);          // внутренние аттрибуты файла
	ОбластьCDFH.ЗаписатьЦелое32(38, 2176057344); // внешние аттрибуты файла
	ОбластьCDFH.ЗаписатьЦелое32(42, 0);          // смещение до структуры Local File Header
	// Название файла, контрольнюу сумму, размеры сжатых и не сжатых данных заполнить позже
	
	// End of central directory record - закрывающая запись
	ОбластьEOCD = Новый БуферДвоичныхДанных(фРезультат.РазмерEOCD);
	ОбластьEOCD.ЗаписатьЦелое32(0,  101010256); // обязательная сигнатура, равна 0x06054b50
	ОбластьEOCD.ЗаписатьЦелое16(4,  0);         // номер диска
	ОбластьEOCD.ЗаписатьЦелое16(6,  0);         // номер диска, где находится начало Central Directory
	ОбластьEOCD.ЗаписатьЦелое16(8,  1);         // количество записей в Central directory в текущем диске
	ОбластьEOCD.ЗаписатьЦелое16(10, 1);         // всего записей в Central Directory
	ОбластьEOCD.ЗаписатьЦелое32(12, фРезультат.РазмерCDFH); // размер Central Directory
	ОбластьEOCD.ЗаписатьЦелое16(20, 0);         // длина комментария
	// Смещение Central Directory заполнить позже
	
	фРезультат.ОбластьLFH  = ОбластьLFH;
	фРезультат.ОбластьDD   = ОбластьDD;
	фРезультат.ОбластьCDFH = ОбластьCDFH;
	фРезультат.ОбластьEOCD = ОбластьEOCD;
	
	Возврат Новый ФиксированнаяСтруктура(фРезультат);
КонецФункции

// Возвращает строку из допустимых символов имени заголовка HTTP-запроса
// 
// Возвращаемое значение:
//  Строка - строка из допустимых символов имени заголовка
//
Функция ДопустимыеСимволыИмениЗаголовка() Экспорт
	Буквы = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	
	Возврат Буквы + НРег(Буквы) + "0123456789!#$%&'*+-.^_`|~";
КонецФункции

// Возвращает множество допустимых символов имени заголовка HTTP-запроса
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие - служебный словарь допустимых символов имени заголовка
//
Функция МножествоДопустимыхСимволовИмениЗаголовка() Экспорт
	фРезультат = Новый Соответствие;
	
	ДопустимыеСимволы = КлиентHTTPПовтИсп.ДопустимыеСимволыИмениЗаголовка();
	
	Для я = 1 По СтрДлина(ДопустимыеСимволы) Цикл
		фРезультат.Вставить(Сред(ДопустимыеСимволы, я, 1), Истина);
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(фРезультат);
КонецФункции

// Возвращает имя события для журнала регистрации
// 
// Возвращаемое значение:
//  Строка - имя события
//
Функция ИмяСобытия() Экспорт
	Возврат "Клиент HTTP";
КонецФункции
#КонецОбласти
