
// SPDX-License-Identifier: Apache-2.0+

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого ЭлементИмпорта Из Параметры.ЭлементыИмпорта Цикл
		ЭлементыИмпорта.Добавить(ЭлементИмпорта["name"]);
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ЭлементыИмпортаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(ВыбраннаяСтрока);
КонецПроцедуры
#КонецОбласти
