
Функция СтрокаBasicАвторизации(Знач Пользователь, Знач Пароль) Экспорт
	Возврат СтрЗаменить(
		Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(Пользователь + ":" + Пароль)),
		Символы.ВК + Символы.ПС,
		""
	);
КонецФункции

Функция РазмерТекстовыхДанных(Знач Текст, Знач Кодировка = Неопределено) Экспорт
	Кодировка = ?(Кодировка = Неопределено, РаботаСHttpПовтИсп.КодировкаПоУмолчанию(), Кодировка);
	
	Поток = Новый ПотокВПамяти;
	Запись = Новый ЗаписьДанных(Поток, Кодировка, , "");
	Запись.ЗаписатьСтроку(Текст);
	ДД = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	Возврат ДД.Размер();
КонецФункции

Функция ТипMIMEРасширенияФайла(Знач РасширениеФайла) Экспорт
	Если СтрНачинаетсяС(РасширениеФайла, ".") Тогда
		РасширениеФайла = Прав(РасширениеФайла, СтрДлина(РасширениеФайла) - 1);
	КонецЕсли;
	
	ТипMIME = РаботаСHttpПовтИсп.ТипыMIMEРасширенийФайлов().Получить(НРег(РасширениеФайла));
	
	Возврат ?(ТипMIME = Неопределено, РаботаСHttpПовтИсп.ТипMIMEOctetStream(), ТипMIME);
КонецФункции
