
// SPDX-License-Identifier: Apache-2.0+

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.ЗаголовокФормы <> Неопределено Тогда
		Заголовок = Параметры.ЗаголовокФормы;
	КонецЕсли;
	
	РедактируемыйТекст = Параметры.Текст;
	
	Если Параметры.ЦветРедактируемогоТекста <> Неопределено Тогда
		Элементы.РедактируемыйТекст.ЦветТекста = Параметры.ЦветРедактируемогоТекста;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийПоляРедактируемогоТекста
&НаКлиенте
Процедура РедактируемыйТекстИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Элементы.РедактируемыйТекст.ЦветТекста = Новый Цвет;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОК(Команда)
	Закрыть(РедактируемыйТекст);
КонецПроцедуры
#КонецОбласти
