
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дополнительно = Новый Структура("Печенье", Новый Соответствие);
	СвойстваПеченьки = РаботаСHttpПовтИсп.СвойстваКакАтрибуты();
	
	Для Каждого Получатель Из Параметры.Печенье Цикл
		Печеньки = Новый Соответствие;
		Для Каждого ПеченькоПолучателя Из Получатель.Значение Цикл
			Печенько = Новый Структура("Имя, Значение, Атрибуты", ПеченькоПолучателя.Значение.Имя, ПеченькоПолучателя.Значение.Значение, Новый Структура);
			Для Каждого СвойствоПеченьки Из РаботаСHttpПовтИсп.СвойстваКакАтрибуты() Цикл
				Печенько.Атрибуты.Вставить(
					СвойствоПеченьки.Ключ,
					?(
						ПеченькоПолучателя.Значение.Свойство(СвойствоПеченьки.Ключ),
						Новый Структура("Имя, Значение, Активно", ТРег(СвойствоПеченьки.Значение), ПеченькоПолучателя.Значение[СвойствоПеченьки.Ключ], Истина),
						Новый Структура("Имя, Значение, Активно", ТРег(СвойствоПеченьки.Значение), "", Ложь)
					)
				);
			КонецЦикла;
			
			Печеньки.Вставить(ПеченькоПолучателя.Ключ, Печенько);
		КонецЦикла;
		
		Дополнительно.Печенье.Вставить(Получатель.Ключ, Печеньки);
	КонецЦикла;
	
	Для Каждого Получатель Из Дополнительно.Печенье Цикл
		Стр = ДоменныеИмена.Добавить();
		Стр.ДоменноеИмя = Получатель.Ключ;
	КонецЦикла;
	
	ДоменныеИмена.Сортировать("ДоменноеИмя");
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДоменныеИменаПриАктивизацииСтроки(Элемент)
	ПеченькиПолучателя.Очистить();
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Печенько Из Дополнительно.Печенье.Получить(Элемент.ТекущиеДанные.ДоменноеИмя) Цикл
		Стр = ПеченькиПолучателя.Добавить();
		Стр.Ключ     = Печенько.Ключ;
		Стр.Имя      = Печенько.Значение.Имя;
		Стр.Значение = Печенько.Значение.Значение;
	КонецЦикла;
	
	ПеченькиПолучателя.Сортировать("Ключ");
КонецПроцедуры

&НаКлиенте
Процедура ПеченькиПолучателяПриАктивизацииСтроки(Элемент)
	АтрибутыПеченьки.Очистить();
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Печеньки = Дополнительно.Печенье.Получить(Элементы.ДоменныеИмена.ТекущиеДанные.ДоменноеИмя);
	Печенько = Печеньки.Получить(ТекущиеДанные.Ключ);
	
	Для Каждого Атрибут Из Печенько.Атрибуты Цикл
		ЗаполнитьЗначенияСвойств(АтрибутыПеченьки.Добавить(), Атрибут.Значение);
	КонецЦикла;
	
	ОтобразитьРецепт(Печенько);
КонецПроцедуры


#Область ДОПОЛНИТЕЛЬНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ
Процедура ОтобразитьРецепт(Знач Печенько = Неопределено)
	Если Печенько = Неопределено Тогда
		ТекущиеДанныеПолучатели = Элементы.ДоменныеИмена.ТекущиеДанные;
		ТекущиеДанныеПеченькиПолучателя = Элементы.ПеченькиПолучателя.ТекущиеДанные;
		
		Если ТекущиеДанныеПолучатели = Неопределено ИЛИ ТекущиеДанныеПеченькиПолучателя = Неопределено Тогда
			Рецепт = "";
			Возврат;
		КонецЕсли;
		
		Печенько = Дополнительно.Печенье.Получить(ТекущиеДанныеПолучатели.ДоменноеИмя).Получить(ТекущиеДанныеПеченькиПолучателя.Ключ);
	КонецЕсли;
	
	ЧастиРецепта = Новый Массив;
	ЧастиПунктаРецепта = Новый Массив;
	
	ЧастиПунктаРецепта.Добавить(Печенько.Имя);
	Если Печенько.Значение <> Неопределено Тогда
		ЧастиПунктаРецепта.Добавить(Печенько.Значение);
	КонецЕсли;
	
	ЧастиРецепта.Добавить(СтрСоединить(ЧастиПунктаРецепта, "="));
	
	Для Каждого Атрибут Из Печенько.Атрибуты Цикл
		ЧастиПунктаРецепта.Очистить();
		
		Если НЕ Атрибут.Значение.Активно Тогда
			Продолжить;
		КонецЕсли;
		
		ЧастиПунктаРецепта.Добавить(Атрибут.Значение.Имя);
		Если ЗначениеЗаполнено(Атрибут.Значение.Значение) Тогда
			ЧастиПунктаРецепта.Добавить(
				?(
					Атрибут.Ключ = РаботаСHttpПовтИсп.СвойствоПеченькаСрок(),
					РаботаСHttpСлужебный.ДатаВHTTP(Атрибут.Значение.Значение),
					Атрибут.Значение.Значение
				)
			);
		КонецЕсли;
		
		ЧастиРецепта.Добавить(СтрСоединить(ЧастиПунктаРецепта, "="));
	КонецЦикла;
	
	Рецепт = СтрСоединить(ЧастиРецепта, "; ");
КонецПроцедуры
#КонецОбласти