
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дополнительно = Новый Структура("Печенье", Новый Соответствие);
	СвойстваПеченьки = РаботаСHttpПовтИсп.СвойстваКакАтрибуты();
	
	Для Каждого Получатель Из Параметры.Печенье Цикл
		Печеньки = Новый Соответствие;
		Для Каждого ПеченькоПолучателя Из Получатель.Значение Цикл
			Печенько = Новый Структура("Имя, Значение, Атрибуты", ПеченькоПолучателя.Значение.Имя, ПеченькоПолучателя.Значение.Значение, Новый Структура);
			Для Каждого СвойствоПеченьки Из РаботаСHttpПовтИсп.СвойстваКакАтрибуты() Цикл
				Печенько.Атрибуты.Вставить(
					СвойствоПеченьки.Ключ,
					?(
						ПеченькоПолучателя.Значение.Свойство(СвойствоПеченьки.Ключ),
						Новый Структура("Имя, Значение, Активно", ТРег(СвойствоПеченьки.Значение), ПеченькоПолучателя.Значение[СвойствоПеченьки.Ключ], Истина),
						Новый Структура("Имя, Значение, Активно", ТРег(СвойствоПеченьки.Значение), "", Ложь)
					)
				);
			КонецЦикла;
			
			Печеньки.Вставить(ПеченькоПолучателя.Ключ, Печенько);
		КонецЦикла;
		
		Дополнительно.Печенье.Вставить(Получатель.Ключ, Печеньки);
	КонецЦикла;
	
	Для Каждого Получатель Из Дополнительно.Печенье Цикл
		Стр = ДоменныеИмена.Добавить();
		Стр.ДоменноеИмя = Получатель.Ключ;
	КонецЦикла;
	
	ДоменныеИмена.Сортировать("ДоменноеИмя");
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДоменныеИменаПриАктивизацииСтроки(Элемент)
	ПеченькиПолучателя.Очистить();
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДоменноеИмя = Элемент.ТекущиеДанные.ДоменноеИмя;
	
	Печеньки = Дополнительно.Печенье.Получить(ДоменноеИмя);
	Если Печеньки = Неопределено Тогда
		Дополнительно.Печенье.Вставить(ДоменноеИмя, Новый Массив);
		Возврат;
	КонецЕсли;
	
	Для Каждого Печенько Из Печеньки Цикл
		Стр = ПеченькиПолучателя.Добавить();
		Стр.Ключ     = Печенько.Ключ;
		Стр.Имя      = Печенько.Значение.Имя;
		Стр.Значение = Печенько.Значение.Значение;
	КонецЦикла;
	
	ПеченькиПолучателя.Сортировать("Ключ");
КонецПроцедуры

&НаКлиенте
Процедура ПеченькиПолучателяПриАктивизацииСтроки(Элемент)
	АтрибутыПеченьки.Очистить();
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Печеньки = Дополнительно.Печенье.Получить(Элементы.ДоменныеИмена.ТекущиеДанные.ДоменноеИмя);
	Печенько = Печеньки.Получить(ТекущиеДанные.Ключ);
	
	Для Каждого Атрибут Из Печенько.Атрибуты Цикл
		ЗаполнитьЗначенияСвойств(АтрибутыПеченьки.Добавить(), Атрибут.Значение);
	КонецЦикла;
КонецПроцедуры
