
Функция ПозицииТокеновПеченья(Знач ОписаниеПеченья) Экспорт
	Возврат КлиентHTTP.ПозицииТокеновПеченья(ОписаниеПеченья);
КонецФункции

Функция ТекущаяУниверсальнаяДатаНаСервере() Экспорт
	Возврат КлиентHTTP.ТекущаяУниверсальнаяДатаНаСервере();
КонецФункции

Функция РаскодированныйИдентификаторРесурса(Знач ИдентификаторРесурса) Экспорт
	Возврат КлиентHTTP.РаскодированныйИдентификаторРесурса(ИдентификаторРесурса);
КонецФункции

Функция ХешСтрока(Знач Данные, Знач Алгоритм) Экспорт
	Возврат КлиентHTTP.ХешСтрока(Данные, Алгоритм);
КонецФункции
